Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorTextType
Defines text visualization types for vector settings of analysis display style.
Since:
2012
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorTextType.ShowPredefined
Show vector text label only for points that have flag ValueAtPointFlags::DisplayText

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorTextType.ShowNone
Don't show vector text labels

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorTextType.ShowAll
Show vector text label for each point